{"hasPreviousPage":false,"previousPageIsFirst":true,"hasNextPage":false,"list":[{"id":"hello","date":"2017-09-27","filename":"posts/hello.md","title":"Spotting bad professionals","layout":"hero","body":{"c":[{"c":[{"c":["#"],"p":{"href":"#intro","className":"phenomic-HeadingAnchor"},"t":"a"},"Intro"],"p":{"id":"intro"},"t":"h1"},"\n",{"c":["Hey yall!\nThis is going to be the first entry on my blog which I've decided to start writing while being bored on a long plane ride."],"t":"p"},"\n",{"c":[{"c":["#"],"p":{"href":"#what-is-this-about","className":"phenomic-HeadingAnchor"},"t":"a"},"What Is This About?"],"p":{"id":"what-is-this-about"},"t":"h2"},"\n",{"c":["Maybe I should start with an introduction about what this blog is going to be about.\nThe truth is: I don't know yet. I need a place to summarize and organize my thoughts and putting it on the Interweb seems to be where all the cool kids do it."],"t":"p"},"\n",{"c":["(I want to be a cool kid too)"],"t":"p"},"\n",{"c":[{"c":["#"],"p":{"href":"#lets-get-to-it","className":"phenomic-HeadingAnchor"},"t":"a"},"Let's Get to It"],"p":{"id":"lets-get-to-it"},"t":"h2"},"\n",{"c":["I've always been fascinated by how certain people are able to break down complex issues into manageable chunks."],"t":"p"},"\n",{"c":["Yuval Noah Harari, Historian, author of Sapiens, is one of those people. Here's a quote from one of the early pages of the book:"],"t":"p"},"\n",{"c":["\n",{"c":["The story of atoms, molecules, and their interactions is called chemistry."],"t":"p"},"\n",{"c":["About 3.8 billion years ago, on a planet called Earth, certain molecules combined to form particularly large and intricate structures called organisms. The story of organisms is called biology."],"t":"p"},"\n",{"c":["About 70,000 years ago, organisms belonging to the species Homo sapiens started to form even more elaborate structures called cultures."],"t":"p"},"\n"],"t":"blockquote"},"\n",{"c":[{"c":["BOOM!"],"t":"strong"}," (no that's not the sound of a bomb getting of, you're fine)"],"t":"p"},"\n",{"c":["Ok, maybe you're thinking: \"Of course you two-legged monkey!\". And maybe you even know some better insults."],"t":"p"},"\n",{"c":["But, that would be beside the point. And the point is that this sets the tone for an interesting novel, a novel about human history but more importantly a person trying to answer:\n\"How can summarize human history inside a single book\". It is no easy task."],"t":"p"},"\n",{"c":["I will not go into details about what is discussed in the book I'd rather do a meta-analysis on the author style and how it altered my behavior."],"t":"p"},"\n",{"c":["And no single sentence affected me more than the following:"],"t":"p"},"\n",{"c":["\n",{"c":["\"... a good historian can find precedent for everything. But an even better historian know when these precedents are but curiosities that cloud the big picture.\""],"t":"p"},"\n"],"t":"blockquote"},"\n",{"c":["I'm going to steal this sentence and apply it to my own field. Actually, scratch that I'll make a general systems rule out of this."],"t":"p"},"\n",{"c":["\n",{"c":["A bad professional can never figure out what matters."],"t":"p"},"\n"],"t":"blockquote"},"\n",{"c":["How would you know you've encountered such a being?"],"t":"p"},"\n",{"c":["Those are, in my opinion (much like the rest of this article), the following:"],"t":"p"},"\n",{"c":["\n",{"c":["When discussing an idea the bad professional will ",{"c":["always"],"t":"em"}," try to answer ",{"c":["How"],"t":"strong"}," first, the ",{"c":["Why"],"t":"strong"}," is secondary and only comes to their mind once the how becomes too complicated or sometimes not at all."],"t":"li"},"\n"],"t":"ul"},"\n",{"c":["But think about it: If there's no Why then by definition it does not matter. The fact that the why is valid or not is a subject for another meta-discussion."],"t":"p"},"\n",{"c":["\n",{"c":["When defending an idea the bad professional will ",{"c":["only"],"t":"em"}," reference to successful past projects. It is common for those bad professionals to avoid looking at failed projects, sometimes even as if turning a blind eye. He'd rather look at those who were blessed with success. Which is a classic case of survivor's bias."],"t":"li"},"\n"],"t":"ul"},"\n",{"c":[{"c":["#"],"p":{"href":"#conclusion","className":"phenomic-HeadingAnchor"},"t":"a"},"Conclusion"],"p":{"id":"conclusion"},"t":"h2"},"\n",{"c":["Now, the bad professional might be a person you know but most likely, it's you."],"t":"p"},"\n",{"c":["Everyone can be the bad professional. No one is terrible constantly and no one is perfect constantly."],"t":"p"},"\n",{"c":["As with most things, being able to identify a pattern is the first step towards better analysis and therefore, increasing your work quality or sometimes avoiding the need for any work."],"t":"p"},"\n",{"c":["There's no intrinsic value to work but there is value to meaning so next time you're faced with a problem at work be the annoying thorn in one's side the world needs you to be."],"t":"p"},"\n",{"t":"hr"},"\n",{"c":[{"c":["#"],"p":{"href":"#further-reading","className":"phenomic-HeadingAnchor"},"t":"a"},"Further Reading"],"p":{"id":"further-reading"},"t":"h2"},"\n",{"c":["Let's look at two of my favorite survivor's bias cases:"],"t":"p"},"\n",{"c":[{"c":["#"],"p":{"href":"#tacoma-bridge","className":"phenomic-HeadingAnchor"},"t":"a"},"Tacoma bridge"],"p":{"id":"tacoma-bridge"},"t":"h3"},"\n",{"c":["During the 19th century, in North America, engineers were starting to develop the first suspension bridges. At first, those early bridges were not being considered to carry heavy loads or to exceed certain length because of the lack of stability in high winds. Nevertheless, considering the limitations some engineers decided to try to build more resistant suspension bridges and succeeded. A few decades later another bridge was being constructed, engineers looked at successful bridges and emulated their features. What was lost though, was the original limitations of suspension bridges. This resulted in one of the biggest failure of industrial engineering: The Tacoma bridge"],"t":"p"},"\n",{"c":["Check ",{"c":["this"],"p":{"href":"https://www.youtube.com/embed/3mclp9QmCGs?start=122"},"t":"a"}," mind ",{"c":["bending"],"t":"em"}," video if you haven't seen it yet."],"t":"p"},"\n",{"c":["Source\nI found this case study in\n",{"c":["Design Paradigms: Case Histories of Error and Judgment in Engineering"],"p":{"href":"https://www.goodreads.com/book/show/16247.Design_Paradigms"},"t":"a"}],"t":"p"},"\n",{"c":[{"c":["#"],"p":{"href":"#ww-ii-planes","className":"phenomic-HeadingAnchor"},"t":"a"},"WW II Planes"],"p":{"id":"ww-ii-planes"},"t":"h3"},"\n",{"c":["During WW II many planes were lost in battle. In an effort to increase their chances of survival people looked at returning planes and decided to reinforce the damaged spots."],"t":"p"},"\n",{"c":["Wait."],"t":"p"},"\n",{"c":["Nothing is wrong with the above statement, at first."],"t":"p"},"\n",{"c":["During that time Abraham Wald, a statistician who was working for the army, concluded that if those planes returned safely and sustained damaged this meant that those were the least likely places to need extra armor. The planes not coming back were getting hit everywhere else."],"t":"p"},"\n",{"c":["If you want to know more about survivor's bias check out this ",{"c":["Wikipedia page"],"p":{"href":"https://en.wikipedia.org/wiki/Survivorship_bias"},"t":"a"}],"t":"p"}],"t":"div"},"key":"2017-09-27-hello"}]}